# Напишите программу, в окно которой пользователь вводит имена своих любимых блюд
# Программа должна сцепить эти строки и выводить полученную строку, как новое блюдо
b = input("Введите перевое блюд:\n")
c = input("Введите второе блюдо:\n")
print("Новое блюдо называется: ", b+c)