# Написать функцию is_year_leap, принимающую 1 аргумент — год, и
# возвращающую True, если год високосный, и False иначе.

a = int(input("Please enter the year for the test: "))
b = a % 4


def leap_year():
    if b == 0:
        print(b == 0)
    if b != 0:
        print(b == 0)


leap_year()
