# Написать функцию is_year_leap, принимающую 1 аргумент — год, и
# возвращающую True, если год високосный, и False иначе.
print("Введите год для проверки, для выхода из программы нажмите '0'\n")


a = int(input("Please enter the year for the test: "))
# b = a % 4


def leap_year():
    if b == 0:
        print(b == 0)
    if b != 0:
        print(b == 0)


# leap_year()

while a != 0:
    b = a % 4
    leap_year()
    a = int(input("Please enter the year for the test: "))

# input("\n\n Click Enter to leave")
