# Виселица
#
# Классическая игра "Виселица". Компьютер случайным образом выбирает слово,
# которое игрок должен отгадать буква за буквой. Если игрок не не сумеет
# отгадать за отведенное количество попыток, на экране появится фигурка повешеного.

# импортируем модуль
import random

# Создание констант
HANGMAN = (
    """
    ------
    |    |
    |
    |
    |
    |
    |
    |
    |
    ----------
    """,
    """
    ------
    |    |
    |    0  |
    |
    |
    |
    |
    |
    |
    ----------
    """,
    """
    ------
    |    |
    |    0  |   -+-
    |
    |
    |
    |
    |
    |
    ----------
    """,
    """
    ------
    |    |
    |    0  |  /-+-
    |
    |
    |
    |
    |
    |
    ----------
    """,
    """
    ------
    |    |
    |    0  |  /-+-/
    |
    |
    |
    |
    |
    |
    ----------
    """,
    """
       ------
       |    |
       |    0  |  /-+-/
       |    |
       |
       |
       |
       |
       |
       ----------
       """,
    """
       ------
       |    |
       |    0  |  /-+-/
       |    |
       |    |
       |   |
       |   |
       |
       |
       ----------
       """,
    """
       ------
       |    |
       |    0  |  /-+-/
       |    |
       |    |
       |   | |
       |   | |
       |
       |
       ----------
       """)

MAX_WRONG = len(HANGMAN) - 1

WORDS = ("OVERUSED", "CLAM", "GUAM", "TAFFETA", "PYTHON")

# инициализация переменных
word = random.choice(WORDS)

so_far = "-" * len(word)